In [8]:
import pandas as pd
import numpy as np

In [5]:
l = [3,4,20,30] #creating
l #showing (if you're using .py ext. file, you need to `print` command)
#Creating and showing an array

[3, 4, 20, 30]

In [7]:
pd.DataFrame(l, columns = ["variable_name"])

   variable_name
0              3
1              4
2             20
3             30

In [12]:
m = np.arange(1,10).reshape((3,3))
m
#Creating & showing a 3 Dimensions array with nums between of 1-10 
#as using numpy library.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [13]:
pd.DataFrame(m, columns=["variable1","variable2","variable3"])

   variable1  variable2  variable3
0          1          2          3
1          4          5          6
2          7          8          9

**So, all of these meaning is that:**

`pd.DataFrame($array, columns=["variable_names"])`

# Giving Name to DataFrame

In [15]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])

In [17]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

Persons are generally giving `df` name for DataFrame sets in Software Industry. We can understand that as reading above the code :

`variable_name = pd.DataFrame($array,columns=["column_names"])`

In [19]:
type(df) #Info the dataframe type

pandas.core.frame.DataFrame

**Extra:** We can see some informations about the dataframe set 
with .`axes` command. You can see the code under this row. (22rd row)

In [22]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

**Meanings are:**

`Start` = Index Start Num

`Stop` = Index Stop Num


`Step` = Index amount of increase

`Index` = Column / Variable names of DataFrame 

`dtype` = Values type

In [23]:
df.shape #You can see the row & column values

(3, 3)

In [24]:
df.ndim #You can see the Dimension Value

2

In [26]:
df.values #You can see the All DataFrame Values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [28]:
type(df.values) #You can see the All Data Frame Values' Type

numpy.ndarray

In [31]:
df.head() #You can see the first 5 Row Elements in DataFrame Set

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [32]:
df.tail() #You can see the last 5 Row Elements in DataFrame set.

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [34]:
#Hasan Baris GOK from Data Manipulation 201 Pandas Directory on GitHub.